{
  "name": "Akshat Gandhi",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Akshat Gandhi – a passionate software engineer and developer",
  "headerTaglineThree": "Building innovative solutions with scalable systems and cutting-edge technologies",
  "headerTaglineFour": "Based in Noida, India, specializing in Full Stack Development",
  "showBlog": true,
  "darkMode": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/iakshatgandhi"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/iakshatgandhi/"
    },
    {
      "id": "3",
      "title": "Twitter",
      "link": "https://twitter.com/iakshatgandhi"
    },
    {
      "id": "4",
      "title": "Blog",
      "link": ""
    },
    {
      "id": "5",
      "title": "Email",
      "link": "business.akshatgandhi@gmail.com"
    }
  ],
  "projects": [
      
    {
      "id": "1",
      "title": "Fraudulent News Detection/Classification",
      "description": "This project utilizes natural language processing (NLP) and machine learning algorithms to classify news articles as real or fake. It features a user-friendly web interface built with Streamlit for effortless interaction.",
      "imageSrc": "./data/images/app.png",
      "url": "https://github.com/iakshatgandhi/Fake-News-Classification-Model-main"
    },
    {
      "id": "2",
      "title": "Tree Visualizer",
      "description": "A dynamic visualization tool for various tree data structures, enhancing the learning experience with real-time interaction",
      "imageSrc": "./data/images/tree_visual.jpeg",
      "url": "https://github.com/iakshatgandhi/Tree-Visualizer-main"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Full Stack Development",
      "description": "Transforming ideas into dynamic web applications using the MERN stack (MongoDB, Express, React, Node.js) and cutting-edge technologies. Focused on responsive design, intuitive user interfaces, and secure back-end services."
    },
    {
      "id": "2",
      "title": "Cloud Solutions & DevOps",
      "description": "Leveraging AWS, Docker, and CI/CD pipelines for scalable and resilient cloud-based solutions. Expertise in containerization, automated workflows, and infrastructure as code (IaC) for seamless deployment."
    },
    {
      "id": "3",
      "title": "Scalable System Design",
      "description": "Designing highly scalable, reliable, and efficient systems using microservices architecture, message queues (Kafka, Redis), and real-time data processing technologies like WebSockets and WebRTC."
    },
    {
      "id": "4",
      "title": "API Development & Integration",
      "description": "Building secure, fast, and robust RESTful APIs, ensuring seamless integration with front-end applications and third-party services. Optimizing performance with proper architecture and caching mechanisms."
    },
    {
      "id": "5",
      "title": "Performance Optimization & Security",
      "description": "Ensuring optimal performance and security of your applications through techniques such as code splitting, DDoS protection, rate limiting, and database indexing. Aiming for low-latency and high-throughput systems."
    }
  ],
  "aboutpara": "I'm Akshat Gandhi, a passionate Full Stack Developer with a deep love for building innovative web applications and scalable systems. Currently pursuing my B.Tech in Computer Science and Engineering at Galgotias University, I specialize in JavaScript, Node.js, AWS, and modern web frameworks. I have a strong foundation in backend technologies and system design, and I love solving complex problems with elegant solutions. My goal is to create software that not only performs well but is also user-friendly and secure. I'm constantly learning new technologies and approaches to stay at the forefront of development practices.",
  "resume": {
    "tagline": "👋  I'm Akshat, a Full Stack Developer, System Designer, and Cloud Architect.",
    "description": "With expertise in JavaScript, Node.js, React, and AWS, I specialize in designing scalable systems, optimizing performance, and integrating cloud solutions.",
    "experiences": [
      {
        "id": "1",
        "dates": "October 2022 - December 2022",
        "type": "Internship",
        "position": "Full Stack Developer Intern at Coincent.ai",
        "bullets": [
          "Developed dynamic and responsive web applications using the MERN stack.",
          "Optimized API performance for faster data retrieval and interaction.",
          "Worked on deploying applications on AWS, setting up CI/CD pipelines for automated deployments."
        ]
      },
      {
        "id": "2",
        "dates": "March 2022 - October 2022",
        "type": "Freelance",
        "position": "Full Stack Developer",
        "bullets": [
          "Built and optimized several web applications from scratch for clients.",
          "Integrated cloud services like AWS S3 for media storage and AWS EC2 for hosting.",
          "Implemented best practices for security and performance in web applications."
        ]
      }
    ],
    "education": {
      "universityName": "Galgotias University",
      "universityDate": "2021 - 2025",
      "universityPara": "Currently pursuing a B.Tech in Computer Science and Engineering with a focus on Full Stack Development, Cloud Computing, and Advanced System Design."
    },
    "languages": ["JavaScript", "C++", "Python", "Java", "SQL"],
    "frameworks": ["React", "Node.js", "Express", "Next.js", "MongoDB", "PostgreSQL", "AWS", "Docker", "GraphQL"],
    "tools": ["Git", "VS Code", "AWS Cloud", "Docker", "Kubernetes", "CI/CD"],
    "others": ["Figma", "Adobe XD", "Postman", "Swagger"]
  }
}
